#define _CRT_SECURE_NO_WARNINGS 1
//描述
//输入两个升序排列的序列，将两个序列合并为一个有序序列并输出。
//输入描述：
//输入包含三行，
//第一行包含两个正整数n, m，用空格分隔。n表示第二行第一个升序序列中数字的个数，m表示第三行第二个升序序列中数字的个数。
//第二行包含n个整数，用空格分隔。
//第三行包含m个整数，用空格分隔。
//输出描述：
//输出为一行，输出长度为n + m的升序序列，即长度为n的升序序列和长度为m的升序序列中的元素重新进行升序序列排列合并。
//输入：
//5 6
//1 3 7 9 22
//2 8 10 17 33 44
//输出：
//1 2 3 7 8 9 10 17 22 33 44
#include <stdio.h>

//思路一：
//int main() 
//{
//    int n, m,i,j,temp=0;
//    int a[100];
//    scanf("%d %d\n", &n, &m);
//    for (i = 0; i < n; i++)
//    {
//        scanf("%d ", &a[i]);//第一行存入数组
//    }
//    for (i = n; i < n+m; i++)
//    {
//        scanf("%d ", &a[i]);//第二行存入数组
//    }
//    //冒泡排序
//
//    //趟数  i
//    //eg.对10个数排序 需要排9趟(i:0~8) i<size-1
//    for (i = 0; i < n + m - 1; i++)
//    {
//        j = 0;
//		//控制相邻两个数的比较  
//        //eg.对10个数排序  第0趟最左边元素需要与9个数比较大小 比较j次
//		//                第1趟最左边元素需要与8个数比较大小
//		//                第2趟最左边元素需要与7个数比较大小
//		//						.......
//		//                第i趟最左边元素需要与size-i-1个数比较大小 比较size-i-1次
//        for (j = 0; j < (n + m - i - 1); j++)
//        {
//            if (a[j] > a[j+1])
//            {
//                //交换
//                temp = a[j];
//                a[j] = a[j+1];
//                a[j+1] = temp;
//            }
//        }
//    }
//    for (i = 0; i < n + m; i++)
//    {
//        printf("%d ", a[i]);
//    }
//    return 0;
//}

//思路二： 归并排序
//将两组数存入两个数组 两个数组之间比较大小 小的数存入第三个数组
//int main()
//{
//	int n, m;
//	int k = 0;
//	scanf("%d %d", &n, &m);
//	int i = 0, j = 0;
//	int arr1[10], arr2[10], arr3[20];
//	//int arr1[n], arr2[m], arr3[n+m];
//	//两行有序数分别放入两个数组
//	for (i = 0; i < n; i++)
//	{
//		scanf("%d", &arr1[i]);
//	}
//	for (j = 0; j < m; j++)
//	{
//		scanf("%d", &arr2[j]);
//	}
//	i = 0;
//	j = 0;
//	k = 0;
//	while (i < n && j < m)
//	{
//		if (arr1[i] < arr2[j])//把较小数放入arr3
//		{
//			arr3[k] = arr1[i];
//			k++; i++;
//		}
//		else
//		{
//			arr3[k] = arr2[j];
//			k++; j++;
//		}
//	}
//	if (i == n)
//		//当i==n说明arr1中的元素已经全部放入arr3  把剩余的arr2中的元素放入arr3即可
//	{
//		while (j < m)
//		{
//			arr3[k] = arr2[j];
//			k++; j++;
//		}
//	}
//	else
//	{
//		while (i < n)
//		{
//			arr3[k] = arr1[i];
//			k++; i++;
//		}
//	}
//	for (k = 0; k < (n + m); k++)
//	{
//		printf("%d ", arr3[k]);
//	}
//	return 0;
//}